{
  "logo": "JAMES WANG",
  "navigation.about": "About",
  "navigation.workExperience": "Work Experience",
  "navigation.projects": "Projects",
  "navigation.contactMe": "Contact Me",
  "navigation.lightMode": "Light",
  "navigation.darkMode": "Dark",
  "hero.heading": "Hello, I'm James!",
  "hero.description.body": "I'm a software engineer focused on frontend development. My work blends thoughtful design with meticulous engineering to create interfaces that empower users at every interaction.",
  "hero.description.cta": "View my work or contact me to learn more!",
  "hero.button.primary": "View work",
  "hero.button.secondary": "Contact me",
  "about.heading": "\"So, tell me about yourself\"",
  "about.description": [
    "Currently, I'm a senior at Carnegie Mellon University, finishing my Bachelor of Science in Statistics and Machine Learning, with a minor in Computer Science. In my final semester, I'm diving into courses that span distributed systems, autonomous agents in robotics, and HCI-focused UI/UX design. Outside of the classroom, I also work as a Teaching Assistant for Introduction to Programming (15-112), where I teach a recitation of 29 students, collaboratively program with students one-on-one during office hours, and monitor their course performance both qualitatively and quantitatively. Teaching is my passion, and I take pride in helping students navigate learning how to program in an era where AI is reshaping computer science education.",
    "Last summer, I interned as a Frontend Software Engineer at Klaviyo on the Adoption Team. I worked on building user-facing features that made it easier for customers to integrate Klaviyo's SMS automation into their owned marketing strategy. One highlight was redesigning the workflow for creating and editing tap-to-subscribe links for collecting SMS consent, which ended up generating a forecasted $230,791 in ARR from increased SMS sends. Working full-time as a software engineer this summer not only strengthened my prior skills in React/TypeScript for frontend development and Django for backend development, but also taught me how to collaborate with product managers, data analysts, and designers to develop high-quality, scalable software that improves outcomes for real customers.",
    "Looking ahead, I want to continue growing as a software engineer in the AI era by learning about the latest AI tools and exploring how to integrate them into my work. In my personal projects, I plan to experiment with new technologies and tackle design and engineering challenges that excite me, sharpening both my technical skills and eye for design. Over the next year, I’m eager to transition from student to professional, building a diverse network of mentors and peers, taking on ambitious projects, and pushing the boundaries of what I can create as an engineer."
  ],
  "workExperience.resume.heading": "Resume Download",
  "workExperience.career.heading": "Professional Experience",
  "workExperience.skills.heading": "Technical Toolbox",
  "workExperience.resume.button.primary": "View",
  "workExperience.resume.button.secondary": "Download",
  "projects.heading": "Project Gallery",
  "projects.cards.explore": "Explore",
  "forms.contactForm.heading": "I'd love to meet you!",
  "forms.contactForm.description": "Fill out the form below, and I'll get an email letting me know you're interested in starting a conversation. I'll follow up as soon as I can.",
  "forms.contactForm.messageInput.placeholder": "Enter your message",
  "forms.contactForm.emailInput.placeholder": "Enter email address",
  "forms.contactForm.sendButton": "Send",
  "forms.externalLinksCard.heading": "Find me here as well!",
  "footer.backToTop": "Back to top",
  "footer.about": "About",
  "footer.workExperience": "Work Experience",
  "footer.projects": "Projects",
  "footer.contactMe": "Contact Me",
  "email": "jmaeswnag@gmail.com",
  "footer.city": "Pittsburgh, PA",
  "footer.copyRight": "James Wang © 2025 · Hosted on GitHub Pages"
}
